JosAlc67/DimecaProject/esp32_triple_as5600/Fase8_Cinematica/Fase8_Cinematica.ino
// Fase 8 - Cinematica: parte de Fase 7 (3 AS5600 + 3 BTS7960 + PID real
// por motor) y agrega una capa de traduccion arriba: el comando
// BEND <theta_deg> <phi_deg> convierte un doblez deseado del tentaculo
// COMPLETO (34cm, 21 segmentos pasivos, cuerpo conico) en los 3 setpoints
// de PID correspondientes - modelo PCC, 3 tendones a 120 grados que corren
// por dentro de los 21 segmentos y anclan solo en la punta, ver la seccion
// "Cinematica" mas abajo. Ademas incluye TURN <theta_deg> <phi_deg>
// [vel_deg_s], que gira la direccion del doblez manteniendo theta fijo -
// a diferencia de BEND (que salta directo al setpoint final de posicion
// de cada motor), TURN controla VELOCIDAD en lazo abierto (feedforward),
// dando un giro conico continuo y suave en vez de reposicionamientos
// discretos - pensado para no soltar algo que el tentaculo tenga agarrado
// al cambiar de direccion. Todo lo demas (encoders, motores, HOME, PID
// individual) es identico a Fase 7.
//
// IMPORTANTE: la lectura de los 3 AS5600 es completamente independiente
// de los motores y se puede probar ahora mismo. Los comandos de motor
// no tienen ningun efecto (ni riesgo) mientras los BTS7960 no tengan
// VCC/B+ energizados - las lineas RPWM/LPWM quedan sin potencia detras.
//
// Bus #1: Wire      (GPIO21/22)  - AS5600 #1
// Bus #2: Wire1     (GPIO32/33)  - AS5600 #2
// Bus #3: SoftWire  (GPIO4/13)   - AS5600 #3 (lectura manual de registros)
// BTS7960 #1: RPWM 25 / LPWM 26
// BTS7960 #2: RPWM 27 / LPWM 18
// BTS7960 #3: RPWM 19 / LPWM 23
//
// Comandos Serial (115200, terminar linea con Enter):
//   M1 / M2 / M3  -> selecciona el motor activo (por defecto: 1)
//   F             -> gira el motor activo hacia adelante a baja velocidad
//   R             -> gira el motor activo en reversa a baja velocidad
//   S             -> detiene el motor activo
//   SS            -> PARADA DE EMERGENCIA: detiene los 3 motores ya
//   CAL1/CAL2/CAL3-> calibra el cero de ese encoder en la posicion FISICA
//                    actual del eje (offset queda guardado en flash,
//                    sobrevive a reinicios). Esto NO reduce el error de
//                    +-1.5 grados de linealidad (eso requiere una
//                    referencia externa y se deja para otra sesion) -
//                    solo fija donde esta el 0 grados de cada sensor,
//                    y ese mismo punto pasa a ser tambien "0 vueltas".
//
// SEGUIMIENTO DE VUELTAS COMPLETAS (multi-turn):
// Los ejes pueden dar varias vueltas completas, asi que ademas del angulo
// dentro de la vuelta actual (0-359.99, con el salto de siempre en la
// frontera) se lleva una POSICION ACUMULADA continua que nunca se reinicia
// sola: sigue sumando o restando aunque cruces 360 grados una y otra vez.
// Para #1/#2 se usa getCumulativePosition()/getRevolutions() de la propia
// libreria AS5600 (verificado en su codigo fuente). Para #3 (bus por
// software, sin libreria) se replica a mano el mismo algoritmo exacto.
// Esa posicion acumulada es la que conviene usar como variable de PID mas
// adelante: al no reiniciarse nunca en 0, no sufre el problema de "salto
// enorme de error" que sí tiene el angulo 0-359.99 cerca de la frontera.
//
// PERSISTENCIA: la posicion acumulada de cada motor se guarda en flash
// (NVS) cada vez que ese motor se detiene (detenerMotor()), y ademas cada
// CHECKPOINT_INTERVALO_MS por seguridad si el ESP32 se apagara mientras un
// motor sigue en movimiento. Al arrancar se restaura, asi "0" sigue
// significando el mismo punto fisico entre reinicios/apagados. Esto NO
// funciona si el eje se mueve a mano sin alimentacion: el AS5600 es un
// sensor relativo para el conteo de vueltas, no detecta nada sin corriente.
//
// IMPORTANTE - requisito de velocidad de actualizacion: el algoritmo de
// conteo de vueltas se rompe si el eje gira mas de media vuelta (180 grados)
// entre dos actualizaciones consecutivas. Por eso la actualizacion de
// posicion ocurre en CADA iteracion de loop() (no solo cada 500ms como la
// impresion por Serial) - mientras el motor no gire absurdamente rapido
// entre dos iteraciones de loop(), esto tiene margen de sobra.

#include <Wire.h>
#include <AS5600.h>
#include <ESP32_SoftWire.h>
#include <Preferences.h>

// ---------------- Encoders ----------------

#define AS5600_ADDR           0x36
#define AS5600_REG_ANGLE        0x0E  // registro CON histeresis; el mismo
                                       // que usa internamente readAngle()
                                       // de la libreria, y por lo tanto el
                                       // mismo que usa getCumulativePosition().
                                       // Se usa aqui para que el sensor #3
                                       // sea consistente con #1/#2.
#define AS5600_REG_STATUS      0x0B
#define AS5600_STATUS_MD       0x20

AS5600 as5600_1(&Wire);
AS5600 as5600_2(&Wire1);
SoftWire i2c3;

// Estado de comunicacion de cada sensor, actualizado en cada iteracion de
// loop() (ver mas abajo). Se declara aqui arriba porque tanto el homing
// como el reporte por Serial lo necesitan.
bool comOk1 = false, comOk2 = false, comOk3 = false;

// ---------------- Calibracion (offset de cero) persistente en NVS ----------------

Preferences prefs;
const char *NVS_NAMESPACE = "as5600cal";

// Offset del sensor #3, aplicado a mano (no hay libreria para el bus software).
// Se guarda/lee como entero de 0 a 4095 (mismo convenio que usa la libreria
// AS5600 internamente para offsets negativos via complemento a 2 en 12 bits).
int16_t offsetRaw3 = 0;

int16_t cargarOffsetRaw(uint8_t indice) {
  char clave[8];
  snprintf(clave, sizeof(clave), "off%u", indice);
  prefs.begin(NVS_NAMESPACE, true); // solo lectura
  int16_t valor = prefs.getShort(clave, 0);
  prefs.end();
  return valor;
}

void guardarOffsetRaw(uint8_t indice, int16_t offsetRaw) {
  char clave[8];
  snprintf(clave, sizeof(clave), "off%u", indice);
  prefs.begin(NVS_NAMESPACE, false); // lectura/escritura
  prefs.putShort(clave, offsetRaw);
  prefs.end();
}

// Posicion acumulada (multi-turn) de cada encoder, persistida para que "0"
// siga significando el mismo punto fisico entre reinicios/apagados. Solo
// es valido si el eje no se movio a mano mientras el ESP32 estaba apagado.
int32_t cargarPosicionAcum(uint8_t indice) {
  char clave[8];
  snprintf(clave, sizeof(clave), "pos%u", indice);
  prefs.begin(NVS_NAMESPACE, true);
  int32_t valor = prefs.getInt(clave, 0);
  prefs.end();
  return valor;
}

void guardarPosicionAcum(uint8_t indice, int32_t valor) {
  char clave[8];
  snprintf(clave, sizeof(clave), "pos%u", indice);
  prefs.begin(NVS_NAMESPACE, false);
  prefs.putInt(clave, valor);
  prefs.end();
}

