JosAlc67/DimecaProject/esp32_triple_as5600/Fase8_Cinematica/Fase8_Cinematica.ino
struct GananciasPID { float Kp; float Ki; float Kd; };

GananciasPID pidMotor[3] = {
  {-2.080548f, -0.420325f, -0.165080f}, // Motor 1 (PID completo)
  {-2.086742f, -0.374856f, -0.150000f}, // Motor 2 (Kd=0 tal cual identificado en MATLAB; se
                                         // agrega -0.15 a mano como punto de partida SIN
                                         // VALIDAR, tomando de referencia el Kd de Motor 1/3
                                         // que tienen Kp/Ki similares. Sin derivativo el motor
                                         // cabeceaba bastante antes de llegar al setpoint - el
                                         // termino derivativo es justo el que amortigua eso.
  {-2.249454f, -0.441603f, -0.179295f}  // Motor 3 (PID completo)
};

const uint32_t PID_INTERVALO_MS = 20;    // ciclo de control: 50 Hz
const float    PID_SALIDA_MAX   = 255.0f; // mismas unidades (duty 0-255) que uso la identificacion

// Piso de friccion estatica: en Fase 6 se confirmo que duty=60 (~23%) NO
// alcanza a arrancar estos motores, y duty=150 (~59%) si. Sin este piso, al
// achicarse el error el PID pide una salida chica que nunca mueve el motor
// - se queda "pegado" esperando a que el integral se infle solo, que es
// justo el error lento y persistente que se vio en las pruebas. VALOR SIN
// VALIDAR EN HARDWARE TODAVIA (punto de partida entre 60 y 150): si el
// motor sigue sin arrancar cerca del setpoint, subelo; si pica/vibra
// demasiado, bajalo.
const uint8_t  PID_DUTY_MIN_FRICCION = 80;

// Dentro de esta banda alrededor del setpoint se considera "llegado": el
// AS5600 ya tiene ~1.5 deg de error de linealidad propio, asi que perseguir
// un error menor que eso es perseguir ruido del sensor, no error real - y
// con el piso de friccion de arriba, insistir ahi solo logra que el motor
// pique sin asentarse nunca.
const float    PID_ZONA_MUERTA_DEG = 1.5f;

float    pidSetpoint[3]      = {0, 0, 0}; // grados, en la misma escala continua "acumulado"
float    pidIntegral[3]      = {0, 0, 0};
float    pidErrorAnterior[3] = {0, 0, 0};
uint32_t pidUltimoTiempo[3]  = {0, 0, 0};

// Limites fisicos de cable, medidos por el usuario: cuanto se puede
// recoger/soltar con seguridad antes de quedarse sin cable o de que el
// carrete empiece a enrollar para el lado contrario. Radio del carrete,
// igual en los 3 motores.
const float R_CARRETE_MM      = 12.0f;
const float L_MAX_RECOGER_MM  = 110.0f; // 11 cm
const float L_MAX_SOLTAR_MM   = 200.0f; // 20 cm

// Bloqueo de seguridad REAL por motor: convierte la posicion acumulada
// ACTUAL de ese motor (no un setpoint calculado, la lectura real del
// encoder) a su equivalente en mm de cable, y compara contra los limites
// de arriba. Antes, L_MAX_RECOGER_MM/L_MAX_SOLTAR_MM solo se usaban para
// recortar el SETPOINT calculado en calcularSetpointsCinematica() - eso
// no evitaba que el motor se PASARA de ese limite durante un sobrepaso
// transitorio (visto en pruebas de TURN con angulos grandes: el motor 3
// llegaba a recoger cuerda mas alla de lo que existe fisicamente,
// enrollandola al reves). Esta funcion es la contraparte real: se llama
// desde escribirComandoMotor() (el unico punto por donde pasa cualquier
// duty, sin importar si lo pide el PID, TURN, HOME o el modo manual), y
// si el motor ya esta en el limite, rechaza cualquier duty que lo empuje
// mas alla - solo deja moverse de vuelta hacia el lado seguro.
bool limiteCableExcedido(uint8_t m, float u) {
  float actualDeg;
  if (!leerAnguloAcumuladoGrados(m, actualDeg)) return false; // sin lectura: no se puede verificar, no bloquea

  float L_actual_mm = actualDeg * (PI / 180.0f) * R_CARRETE_MM;

  // u > 0 (adelante) RESTA del acumulado -> reduce L_actual_mm (mas
  // recoger). u < 0 (reversa) SUMA -> aumenta L_actual_mm (mas soltar).
  if (L_actual_mm <= -L_MAX_RECOGER_MM && u > 0.0f) return true;
  if (L_actual_mm >=  L_MAX_SOLTAR_MM  && u < 0.0f) return true;
  return false;
}

// Escribe un duty CON SIGNO en el motor `m`: positivo = adelante (RPWM),
// negativo = reversa (LPWM), 0 = detenido. Bypassa girarAdelante()/
// girarReversa() a proposito (ver nota arriba), pero si actualiza
// estadoMotor[] para que STATUS y el resto del sistema lo reporten bien.
void escribirComandoMotor(uint8_t m, float u) {
  if (limiteCableExcedido(m, u)) u = 0.0f;

  float magnitud = fabs(u);
  if (magnitud > PID_SALIDA_MAX) magnitud = PID_SALIDA_MAX;
  uint8_t duty = (uint8_t)magnitud;

  if (u > 0.0f) {
    escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
    escribirPWM(PIN_RPWM[m], canalRPWM(m), duty);
    estadoMotor[m] = ADELANTE;
  } else if (u < 0.0f) {
    escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
    escribirPWM(PIN_LPWM[m], canalLPWM(m), duty);
    estadoMotor[m] = REVERSA;
  } else {
    escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
    escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
    estadoMotor[m] = PARADO;
  }
}

void iniciarPID(uint8_t m, float setpointDeg) {
  if (homingActivo[m]) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - HOME activo en este motor, manda S primero.");
    return;
  }
  // El guard de "debe estar PARADO" tiene sentido para bang-bang (F/R/HOME:
  // cambiar de sentido de golpe a velocidad fija es riesgoso), pero no para
  // PID - redirigir un lazo cerrado que ya esta corriendo (pidActivo[m])
  // hacia un setpoint nuevo es normal y seguro, el PID hace la transicion
  // solo. Sin esta excepcion, BEND no podia retargetear un motor que
  // todavia estuviera convergiendo del BEND anterior.
  if (estadoMotor[m] != PARADO && !pidActivo[m]) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - detenlo (S) antes de iniciar PID.");
    return;
  }
  float actual;
  if (!leerAnguloAcumuladoGrados(m, actual)) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - encoder sin comunicacion, no se puede iniciar PID.");
    return;
  }
  pidSetpoint[m]      = setpointDeg;
  pidIntegral[m]      = 0.0f;
  pidErrorAnterior[m] = setpointDeg - actual;
  pidUltimoTiempo[m]  = millis();
  pidActivo[m]        = true;
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.print(": PID activo, setpoint=");
  Serial.print(setpointDeg, 2);
  Serial.print(" deg (actual=");
  Serial.print(actual, 2);
  Serial.println(" deg)");
}

void detenerPID(uint8_t m) {
  pidActivo[m] = false;
  detenerMotor(m);
}

// Se llama en CADA iteracion de loop() para los motores con PID activo.
// Internamente se autolimita a PID_INTERVALO_MS (no necesita otro control
// de tiempo por fuera).
void actualizarPID(uint8_t m) {
  if (!pidActivo[m]) return;

  uint32_t ahora = millis();
  if (ahora - pidUltimoTiempo[m] < PID_INTERVALO_MS) return;
  float dt = (ahora - pidUltimoTiempo[m]) / 1000.0f;
  pidUltimoTiempo[m] = ahora;

  float actual;
  if (!leerAnguloAcumuladoGrados(m, actual)) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": PID ABORTADO - se perdio comunicacion con el encoder.");
    detenerPID(m);
    return;
  }

