JosAlc67/DimecaProject/esp32_triple_as5600/Fase8_Cinematica/Fase8_Cinematica.ino
  float error = pidSetpoint[m] - actual;

  if (fabs(error) <= PID_ZONA_MUERTA_DEG) {
    // Ya llegamos (dentro del margen de ruido del sensor): no seguir
    // forzando el motor contra su propia friccion estatica por una
    // fraccion de grado que ademas no se puede medir con certeza.
    pidErrorAnterior[m] = error;
    escribirComandoMotor(m, 0.0f);
    return;
  }

  float integralTentativa = pidIntegral[m] + error * dt;
  float derivada = (dt > 0.0f) ? (error - pidErrorAnterior[m]) / dt : 0.0f;

  GananciasPID &g = pidMotor[m];
  float salida = g.Kp * error + g.Ki * integralTentativa + g.Kd * derivada;

  // Anti-windup simple: si la salida ya esta saturada, no sigue acumulando
  // el termino integral (evita que el integrador se "infle" sin limite
  // mientras el motor de todos modos no puede ir mas rapido).
  if (salida > PID_SALIDA_MAX || salida < -PID_SALIDA_MAX) {
    salida = constrain(salida, -PID_SALIDA_MAX, PID_SALIDA_MAX);
  } else {
    pidIntegral[m] = integralTentativa;
  }

  // Piso de friccion: si el PID pide movimiento pero por debajo del duty
  // que vence la friccion estatica, subirlo a ese piso (conservando el
  // signo) - si no, el motor nunca arranca cerca del setpoint.
  if (salida > 0.0f && salida < (float)PID_DUTY_MIN_FRICCION) {
    salida = (float)PID_DUTY_MIN_FRICCION;
  } else if (salida < 0.0f && salida > -(float)PID_DUTY_MIN_FRICCION) {
    salida = -(float)PID_DUTY_MIN_FRICCION;
  }

  pidErrorAnterior[m] = error;
  escribirComandoMotor(m, salida);
}

// ---------------- Cinematica (PCC: 3 cables a 120 grados) ----------------
//
// Traduce un doblez deseado del segmento - theta (magnitud, 0 = recto) y
// phi (direccion, acimut 0-360) - a los 3 setpoints de motor que ya
// entiende iniciarPID()/PIDn. Es pura matematica, no toca ningun motor
// directamente: reusa el 100% del PID ya construido y sintonizado.
//
// Modelo PCC estandar para N cables a un radio r_cable del eje central del
// segmento, cable i en la posicion angular phi_i:
//   deltaL_i = -theta_rad * r_cable * cos(phi - phi_i)
// El cable del lado hacia el que se dobla (phi cerca de phi_i) se acorta
// (deltaL negativo -> hay que recoger); el del lado opuesto se alarga
// (deltaL positivo -> hay que soltar). Coincide con que los cables solo
// jalan (no empujan) - por eso los 3 motores deben estar activos siempre,
// ninguno puede quedar "libre".
//
// IMPORTANTE: el tentaculo NO es un cilindro de un solo segmento - es un
// cuerpo conico de 21 segmentos pasivos (34 cm de largo total), y los 3
// tendones corren por dentro de todos ellos anclando solo en la punta (el
// segmento mas chico). O sea los 3 motores doblan el tentaculo COMPLETO
// como un solo arco de curvatura constante (PCC), no solo el primer
// segmento - los 21 segmentos son pasivos, no tienen motor propio.
//
// Como el radio del cable cambia a lo largo del cono (32mm en la base, ya
// no es constante), la integral de deltaL a lo largo del arco para un cono
// de conicidad LINEAL con curvatura constante se reduce, tras cancelarse
// el largo total, a la MISMA formula de arriba pero usando el radio
// PROMEDIO entre la base y la punta en vez de un radio de un solo punto:
//   r_cable_efectivo = (r_base + r_punta) / 2 = (32 + 4.5) / 2 = 18.25 mm
//
// Constante medida por el usuario en el hardware real. R_CARRETE_MM,
// L_MAX_RECOGER_MM y L_MAX_SOLTAR_MM se declaran mas arriba, junto a
// escribirComandoMotor() - las necesita ahi el bloqueo de seguridad por
// posicion real (ver ese comentario para el porque).
const float R_CABLE_MM        = 18.25f; // radio efectivo (promedio base/punta del cono, ver arriba)

// Posicion angular de cada cable (grados), asumiendo Motor 1/2/3 a 0/120/240
// - coincide con el mapeo motor<->encoder 1-1,2-2,3-3 ya confirmado. Si la
// disposicion fisica real de los cables no es exactamente esta, este es el
// unico lugar que hay que corregir.
const float PHI_CABLE_DEG[3] = {0.0f, 120.0f, 240.0f};

// Ultimo (theta, phi) comandado - no es una lectura de sensor, es la
// referencia que el propio sistema de cinematica esta pidiendo en este
// momento. La usa TURN para saber desde donde arrancar el giro sin que el
// usuario tenga que repetir el theta actual cada vez.
float thetaActualCmd = 0.0f;
float phiActualCmd   = 0.0f;

// ---------------- TURN: giro por control de VELOCIDAD (feedforward) ----------------
//
// BEND salta directo al setpoint final de cada motor. La primera version
// de TURN reescribia el setpoint de POSICION del PID cada 50ms en pasos
// chicos, pero el PID de posicion tiene piso de friccion y zona muerta
// pensados para asentarse en un punto FIJO, no para perseguir una
// referencia en movimiento continuo - cada paso chico disparaba un
// "tiron" nuevo del piso de friccion, sintiendose brusco/tropero.
//
// Esta version controla velocidad en lazo abierto (feedforward) en vez de
// posicion: se deriva la formula de PCC respecto a phi para saber a que
// velocidad angular debe girar cada motor en cada instante, se convierte
// esa velocidad a duty con el factor deg/s-por-duty ya obtenido en CALVEL,
// y se escribe ese duty directo (bypasseando el PID de posicion mientras
// dura el giro). El resultado: mientras phi barre, cada motor acelera y
// frena de forma continua segun sin(phi - phi_i) - los que deben soltar
// cable y los que deben recogerlo cambian de forma suave, no a saltos: un
// "tira y afloja" continuo entre los 3 en vez de reposicionamientos
// discretos. Al llegar al destino, se apaga el lazo abierto y se entrega
// el control al PID de posicion (mismo camino que BEND) para asentar con
// precision en el punto final.

// deg/s reales por unidad de duty, derivado de los resultados de CALVEL
// (los 3 motores quedaron calibrados a ~55.22 deg/s en su duty corregido:
// M1=139, M2=122, M3=135). Aproximacion lineal - ignora la no linealidad
// de la friccion estatica en duties muy bajos, valida solo lejos de esa
// zona (por eso el piso GIRO_DUTY_MIN_FRICCION de mas abajo).
const float K_DUTY_A_VELOCIDAD[3] = {55.22f / 139.0f, 55.22f / 122.0f, 55.22f / 135.0f};

bool     giroActivo        = false;
float    giroThetaFijo     = 0.0f;
float    giroPhiDestino    = 0.0f;
float    giroVelocidadDegS = 0.0f;
uint32_t giroUltimoTiempo  = 0;
bool     giroEsperandoAsentar = false; // true: phi de software ya llego, esperando a que los motores reales confirmen
uint32_t giroTiempoEspera     = 0;

