JosAlc67/DimecaProject/esp32_triple_as5600/Fase8_Cinematica/Fase8_Cinematica.ino
const uint32_t GIRO_INTERVALO_MS            = 20;   // igual que el PID (50 Hz) - duty se siente continuo
const float    GIRO_VELOCIDAD_DEG_S_DEFAULT = 15.0f; // velocidad angular por defecto, sin validar en hardware
const float    GIRO_TOLERANCIA_DEG          = 1.0f;
const float    GIRO_DUTY_MIN_FRICCION       = 70.0f; // piso de arranque, mismo criterio que PID_DUTY_MIN_FRICCION

// Frena antes de llegar (menos inercia/coast, menos sobrepaso), mismo
// criterio que ya se uso para HOME.
const float    GIRO_ZONA_LENTA_DEG          = 20.0f;
const float    GIRO_VELOCIDAD_MINIMA_DEG_S  = 3.0f;

// Antes de entregarle el control al PID (ganancia ~-2.08 a -2.25, mucho
// mas fuerte que la correccion suave de aca arriba), hay que confirmar
// que los 3 motores REALES ya estan cerca del setpoint final - no solo
// que el phi de software llego. Entregar el control con un error real
// todavia grande es lo que generaba el sobrepaso grande reportado en
// pruebas: el salto de "correccion suave" a "PID a toda ganancia" con
// varios grados de error de por medio es un golpe fuerte de una.
const float    GIRO_TOLERANCIA_POSICION_DEG = 2.0f;
// Salvavidas: si por lo que sea nunca converge exactamente dentro de
// GIRO_TOLERANCIA_POSICION_DEG (p.ej. quedo justo en el borde y oscila
// ahi por el piso de friccion), no se queda esperando para siempre.
const uint32_t GIRO_TIMEOUT_ASENTADO_MS     = 3000;

// Ganancia de la correccion contra la posicion real del encoder (ver
// actualizarGiro). Negativa por el mismo motivo que las ganancias del PID
// normal (duty positivo resta del acumulado). Deliberadamente mas chica en
// magnitud que el Kp del PID (~-2.08 a -2.25): aqui es solo un ajuste
// fino sobre el feedforward, no el control principal - una ganancia tan
// fuerte como la del PID pelearia contra el feedforward en vez de solo
// corregirlo. Sin validar en hardware todavia.
const float    GIRO_KP_CORRECCION           = -0.5f;

// Diferencia angular con signo, en (-180, 180], tomando siempre el camino
// mas corto de "desde" a "hasta" - evita que un giro de 350 grados se haga
// dando toda la vuelta larga quedando del lado equivocado.
float diferenciaAngularCorta(float desde, float hasta) {
  float diff = fmodf(hasta - desde + 180.0f, 360.0f);
  if (diff < 0) diff += 360.0f;
  return diff - 180.0f;
}

// Calcula los 3 setpoints de motor (grados) para un doblez (theta, phi)
// dados, dejando el resultado en setpoints[3]. Aplica los limites fisicos
// de cable (L_MAX_RECOGER_MM / L_MAX_SOLTAR_MM) por seguridad - si theta
// pide mas cable del que hay margen, se recorta ahi (no se aborta).
void calcularSetpointsCinematica(float theta_deg, float phi_deg, float setpoints[3]) {
  float theta_rad = theta_deg * (PI / 180.0f);
  float phi_rad = phi_deg * (PI / 180.0f);

  for (uint8_t i = 0; i < 3; i++) {
    float phi_i_rad = PHI_CABLE_DEG[i] * (PI / 180.0f);
    float deltaL_mm = -theta_rad * R_CABLE_MM * cosf(phi_rad - phi_i_rad);

    if (deltaL_mm < -L_MAX_RECOGER_MM) deltaL_mm = -L_MAX_RECOGER_MM;
    if (deltaL_mm > L_MAX_SOLTAR_MM) deltaL_mm = L_MAX_SOLTAR_MM;

    setpoints[i] = (deltaL_mm / R_CARRETE_MM) * (180.0f / PI);
  }
}

// Comando BEND <theta_deg> <phi_deg>: calcula los setpoints y activa el PID
// de los 3 motores a la vez. Requiere los 3 motores detenidos (mismo
// criterio que CALVEL) - si alguno esta en HOME o PID activo, iniciarPID()
// ya rechaza individualmente con su propio mensaje.
void iniciarCinematica(float theta_deg, float phi_deg) {
  giroActivo = false; // BEND es un salto directo al setpoint final, cancela cualquier TURN en curso
  thetaActualCmd = theta_deg;
  phiActualCmd   = phi_deg;

  float setpoints[3];
  calcularSetpointsCinematica(theta_deg, phi_deg, setpoints);

  Serial.print("BEND theta=");
  Serial.print(theta_deg, 2);
  Serial.print(" deg | phi=");
  Serial.print(phi_deg, 2);
  Serial.print(" deg -> setpoints: M1=");
  Serial.print(setpoints[0], 2);
  Serial.print(" | M2=");
  Serial.print(setpoints[1], 2);
  Serial.print(" | M3=");
  Serial.println(setpoints[2], 2);

  for (uint8_t m = 0; m < 3; m++) iniciarPID(m, setpoints[m]);
}

// Comando TURN <theta_deg> <phi_destino_deg> [velocidad_deg_s]: gira hacia
// phi_destino_deg mantieniendo theta_deg fijo durante todo el giro (igual
// convencion de argumentos que BEND: primero cuanto cerrar, despues hacia
// donde). Apaga el PID de posicion de los 3 motores mientras dura el giro
// - lo controla actualizarGiro() por duty directo (ver arriba el porque).
void iniciarGiro(float thetaFijoDeg, float phiDestinoDeg, float velocidadDegS) {
  if (homingActivo[0] || homingActivo[1] || homingActivo[2]) {
    Serial.println("TURN: RECHAZADO - hay un HOME activo, manda S primero.");
    return;
  }

  giroThetaFijo     = thetaFijoDeg;
  giroPhiDestino    = phiDestinoDeg;
  giroVelocidadDegS = (velocidadDegS > 0.0f) ? velocidadDegS : GIRO_VELOCIDAD_DEG_S_DEFAULT;
  giroUltimoTiempo  = millis();
  giroActivo        = true;
  giroEsperandoAsentar = false;
  thetaActualCmd    = thetaFijoDeg;

  // El PID de posicion se apaga mientras dura el giro - actualizarGiro()
  // escribe duty directo (feedforward de velocidad), no setpoints de
  // posicion. Se reactiva solo al llegar al destino, para asentar fino.
  for (uint8_t m = 0; m < 3; m++) pidActivo[m] = false;

  Serial.print("TURN: girando de phi=");
  Serial.print(phiActualCmd, 2);
  Serial.print(" a phi=");
  Serial.print(giroPhiDestino, 2);
  Serial.print(" deg, manteniendo theta=");
  Serial.print(giroThetaFijo, 2);
  Serial.print(" deg, a ");
  Serial.print(giroVelocidadDegS, 1);
  Serial.println(" deg/s.");
}

// Se llama en cada iteracion de loop(). Mientras el giro esta activo,
// calcula la velocidad angular que necesita cada motor en este instante
// (derivada de la formula PCC respecto a phi) y escribe el duty
// correspondiente directo - sin pasar por el PID de posicion. Al llegar al
// destino, entrega el control al PID (mismo camino que BEND) para asentar
// con precision en el punto final.
void actualizarGiro() {
  if (!giroActivo) return;

  uint32_t ahora = millis();
  if (ahora - giroUltimoTiempo < GIRO_INTERVALO_MS) return;
  float dtSeg = (ahora - giroUltimoTiempo) / 1000.0f;
  giroUltimoTiempo = ahora;

  float restante = diferenciaAngularCorta(phiActualCmd, giroPhiDestino);
  bool  phiCerca  = fabs(restante) <= GIRO_TOLERANCIA_DEG;

