JosAlc67/DimecaProject/esp32_triple_as5600/Fase8_Cinematica/Fase8_Cinematica.ino
  // El phi de software ya llego (o esta a punto): a partir de aqui deja
  // de avanzar, se congela en el destino final. Todavia no se le entrega
  // el control al PID - primero hay que confirmar que los 3 motores
  // REALES tambien llegaron (ver el bloque de abajo).
  float phiObjetivoInstante = phiCerca ? giroPhiDestino : phiActualCmd;

  float setpointsRef[3];
  calcularSetpointsCinematica(giroThetaFijo, phiObjetivoInstante, setpointsRef);

  if (phiCerca) {
    if (!giroEsperandoAsentar) {
      giroEsperandoAsentar = true;
      giroTiempoEspera = ahora;
    }

    bool listos = true;
    for (uint8_t m = 0; m < 3; m++) {
      float actual;
      if (leerAnguloAcumuladoGrados(m, actual) && fabs(setpointsRef[m] - actual) > GIRO_TOLERANCIA_POSICION_DEG) {
        listos = false;
      }
    }
    bool seVencioElTiempo = (ahora - giroTiempoEspera) > GIRO_TIMEOUT_ASENTADO_MS;

    if (listos || seVencioElTiempo) {
      giroActivo = false;
      phiActualCmd = giroPhiDestino;

      // iniciarPID() rechaza si estadoMotor[m] != PARADO y pidActivo[m]
      // es falso - y aqui SIEMPRE es asi, porque escribirComandoMotor()
      // (usado durante todo el giro) deja estadoMotor[m] en
      // ADELANTE/REVERSA, no en PARADO.
      for (uint8_t m = 0; m < 3; m++) detenerMotor(m);
      for (uint8_t m = 0; m < 3; m++) iniciarPID(m, setpointsRef[m]);

      if (seVencioElTiempo && !listos) {
        Serial.println("TURN: giro completado (tiempo de espera agotado, no todos los motores confirmaron), PID tomando el control.");
      } else {
        Serial.println("TURN: giro completado, PID tomando el control para asentar.");
      }
      return;
    }
    // Si no estan listos todavia, sigue abajo aplicando SOLO la
    // correccion suave (el feedforward de velocidad da 0 porque phi ya
    // no avanza) - entregar el control al PID de golpe con un error real
    // todavia grande es lo que generaba el sobrepaso: el salto de
    // "correccion suave" a "PID a toda ganancia" con varios grados de
    // diferencia de por medio es un golpe fuerte de una.
  }

  float sentido = (restante > 0.0f) ? 1.0f : -1.0f;

  // Zona lenta: reduce la velocidad de barrido conforme se acerca al
  // destino (menos inercia/coast al llegar, menos sobrepaso), mismo
  // criterio que ya se uso para HOME.
  float velocidadEfectiva = giroVelocidadDegS;
  if (!phiCerca && fabs(restante) < GIRO_ZONA_LENTA_DEG) {
    velocidadEfectiva = giroVelocidadDegS * (fabs(restante) / GIRO_ZONA_LENTA_DEG);
    if (velocidadEfectiva < GIRO_VELOCIDAD_MINIMA_DEG_S) velocidadEfectiva = GIRO_VELOCIDAD_MINIMA_DEG_S;
  }

  float thetaRad     = giroThetaFijo * (PI / 180.0f);
  float dPhiDt_rad   = phiCerca ? 0.0f : (sentido * velocidadEfectiva * (PI / 180.0f)); // rad/s
  float phiActualRad = phiActualCmd * (PI / 180.0f);

  for (uint8_t m = 0; m < 3; m++) {
    float phi_i_rad = PHI_CABLE_DEG[m] * (PI / 180.0f);
    // d(deltaL)/dt = theta_rad * r_cable * sin(phi - phi_i) * dphi/dt
    float dL_dt = thetaRad * R_CABLE_MM * sinf(phiActualRad - phi_i_rad) * dPhiDt_rad;
    // grados de motor por segundo:
    float dThetaMotor_dt = (dL_dt / R_CARRETE_MM) * (180.0f / PI);
    // Signo: en esta planta (confirmado en hardware, mismo criterio que
    // usa el PID normal) duty positivo (adelante) RESTA del acumulado y
    // duty negativo (reversa) SUMA - por eso el feedforward va con signo
    // negativo aqui; sin este signo el motor gira al reves de lo que
    // phiActualCmd asume, y el error crece sin freno en vez de cerrarse
    // (la causa del "sube sin limite" en pruebas con theta/phi grandes).
    float dutyFF = -dThetaMotor_dt / K_DUTY_A_VELOCIDAD[m];

    // Correccion contra la posicion REAL del encoder (no solo el phi que
    // lleva el software) - sin esto, cualquier imprecision del factor
    // duty->velocidad (peor a duty alto, que es justo donde mas se nota
    // con theta/phi grandes) se acumularia sin freno durante todo el giro.
    float actual;
    float dutyCorreccion = 0.0f;
    if (leerAnguloAcumuladoGrados(m, actual)) {
      float error = setpointsRef[m] - actual;
      dutyCorreccion = GIRO_KP_CORRECCION * error; // mismo signo negativo que el PID normal
    }

    float duty = dutyFF + dutyCorreccion;
    if (duty > 0.0f && duty < GIRO_DUTY_MIN_FRICCION) duty = GIRO_DUTY_MIN_FRICCION;
    else if (duty < 0.0f && duty > -GIRO_DUTY_MIN_FRICCION) duty = -GIRO_DUTY_MIN_FRICCION;
    duty = constrain(duty, -255.0f, 255.0f);

    escribirComandoMotor(m, duty);
  }

  if (!phiCerca) {
    phiActualCmd += sentido * velocidadEfectiva * dtSeg;
  }
}

// Imprime el estado de los 3 encoders bajo demanda (comando STATUS), en vez
// de hacerlo automaticamente cada cierto tiempo - eso generaba demasiado
// ruido visual en el Monitor Serial.
void imprimirEstadoCompleto() {
  bool imanOk1 = comOk1 && as5600_1.magnetDetected();
  bool imanOk2 = comOk2 && as5600_2.magnetDetected();
  uint8_t st3 = 0;
  bool imanOk3 = comOk3 && leerReg8_bus3(AS5600_REG_STATUS, st3) && (st3 & AS5600_STATUS_MD);

  imprimirPosicion("AS5600 #1", comOk1, as5600_1.getCumulativePosition(false), as5600_1.getRevolutions(), imanOk1);
  imprimirPosicion("AS5600 #2", comOk2, as5600_2.getCumulativePosition(false), as5600_2.getRevolutions(), imanOk2);
  imprimirPosicion("AS5600 #3", comOk3, posicionAcum3, revoluciones3(), imanOk3);

  Serial.print("Velocidad actual (deg/s) -> M1: ");
  Serial.print(velocidadEstimadaDegS[0], 2);
  Serial.print(" | M2: ");
  Serial.print(velocidadEstimadaDegS[1], 2);
  Serial.print(" | M3: ");
  Serial.println(velocidadEstimadaDegS[2], 2);

  for (uint8_t m = 0; m < 3; m++) {
    if (!pidActivo[m]) continue;
    float actual;
    leerAnguloAcumuladoGrados(m, actual);
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.print(": PID activo | setpoint=");
    Serial.print(pidSetpoint[m], 2);
    Serial.print(" deg | actual=");
    Serial.print(actual, 2);
    Serial.print(" deg | error=");
    Serial.print(pidSetpoint[m] - actual, 2);
    Serial.println(" deg");
  }
  Serial.println("---");
}

void procesarComando(String cmd) {
  cmd.trim();
  cmd.toUpperCase();

  if (cmd == "M1") { motorActivo = 0; Serial.println("Motor activo: 1"); }
  else if (cmd == "M2") { motorActivo = 1; Serial.println("Motor activo: 2"); }
  else if (cmd == "M3") { motorActivo = 2; Serial.println("Motor activo: 3"); }
  else if (cmd == "F") girarAdelante(motorActivo);
  else if (cmd == "R") girarReversa(motorActivo);
  else if (cmd == "S") { homingActivo[motorActivo] = false; pidActivo[motorActivo] = false; giroActivo = false; detenerMotor(motorActivo); }
  else if (cmd == "SS") {
    giroActivo = false;
    for (uint8_t i = 0; i < 3; i++) { homingActivo[i] = false; pidActivo[i] = false; detenerMotor(i); }
    Serial.println("PARADA DE EMERGENCIA: los 3 motores detenidos.");
  }
  else if (cmd == "CAL1") calibrarSensor(1);
  else if (cmd == "CAL2") calibrarSensor(2);
  else if (cmd == "CAL3") calibrarSensor(3);
  else if (cmd == "HOME1") iniciarHoming(0);
  else if (cmd == "HOME2") iniciarHoming(1);
  else if (cmd == "HOME3") iniciarHoming(2);
  else if (cmd == "HOME") {
    for (uint8_t i = 0; i < 3; i++) iniciarHoming(i);
  }
  else if (cmd == "STATUS") imprimirEstadoCompleto();
  else if (cmd == "CALVEL") calibrarVelocidades();
  else if (cmd.startsWith("CALVEL ")) {
    // Formato: CALVEL M<1-3> <duty 0-255>. Ejemplo: CALVEL M3 225
    String resto = cmd.substring(7);
    resto.trim();
    int espacio = resto.indexOf(' ');
    bool formatoValido = false;
    if (espacio > 0) {
      String parteMotor = resto.substring(0, espacio);
      String parteDuty = resto.substring(espacio + 1);
      parteMotor.trim();
      parteDuty.trim();
      if (parteMotor.length() == 2 && parteMotor.charAt(0) == 'M') {
        int numMotor = parteMotor.substring(1).toInt();
        int duty = parteDuty.toInt();
        if (numMotor >= 1 && numMotor <= 3 && duty >= 0 && duty <= 255) {
          formatoValido = true;
          calibrarVelocidadesConReferencia((uint8_t)(numMotor - 1), (uint8_t)duty);
        }
      }
    }
    if (!formatoValido) {
      Serial.println("Formato invalido. Usa: CALVEL M<1-3> <duty 0-255>. Ejemplo: CALVEL M3 225");
    }
  }
  else if (cmd.startsWith("PID1 ")) iniciarPID(0, cmd.substring(5).toFloat());
  else if (cmd.startsWith("PID2 ")) iniciarPID(1, cmd.substring(5).toFloat());
  else if (cmd.startsWith("PID3 ")) iniciarPID(2, cmd.substring(5).toFloat());
  else if (cmd.startsWith("SETVEL1 ")) fijarVelocidadMotor(0, (uint8_t)constrain(cmd.substring(8).toInt(), 0, 255));
  else if (cmd.startsWith("SETVEL2 ")) fijarVelocidadMotor(1, (uint8_t)constrain(cmd.substring(8).toInt(), 0, 255));
  else if (cmd.startsWith("SETVEL3 ")) fijarVelocidadMotor(2, (uint8_t)constrain(cmd.substring(8).toInt(), 0, 255));
  else if (cmd.startsWith("BEND ")) {
    // Formato: BEND <theta_deg> <phi_deg>. Ejemplo: BEND 15 90
    String resto = cmd.substring(5);
    resto.trim();
    int espacio = resto.indexOf(' ');
    if (espacio > 0) {
      float theta = resto.substring(0, espacio).toFloat();
      float phi = resto.substring(espacio + 1).toFloat();
      iniciarCinematica(theta, phi);
    } else {
      Serial.println("Formato invalido. Usa: BEND <theta_deg> <phi_deg>. Ejemplo: BEND 15 90");
    }
  }
  else if (cmd.startsWith("TURN ")) {
    // Formato: TURN <theta_deg> <phi_destino_deg> [velocidad_deg_s].
    // Ejemplo: TURN 45 270   o   TURN 45 270 15
    String resto = cmd.substring(5);
    resto.trim();
    int esp1 = resto.indexOf(' ');
    if (esp1 > 0) {
      float thetaDeg = resto.substring(0, esp1).toFloat();
      String resto2 = resto.substring(esp1 + 1);
      resto2.trim();
      int esp2 = resto2.indexOf(' ');
      float phiDestino, velocidad = 0.0f;
      if (esp2 > 0) {
        phiDestino = resto2.substring(0, esp2).toFloat();
        velocidad = resto2.substring(esp2 + 1).toFloat();
      } else {
        phiDestino = resto2.toFloat();
      }
      iniciarGiro(thetaDeg, phiDestino, velocidad);
    } else {
      Serial.println("Formato invalido. Usa: TURN <theta_deg> <phi_deg> [vel_deg_s]. Ejemplo: TURN 45 270 15");
    }
  }
  else if (cmd.length() > 0) {
    Serial.println("Comando no reconocido. Usa: M1 M2 M3 F R S SS CAL1 CAL2 CAL3 HOME1 HOME2 HOME3 HOME STATUS CALVEL CALVEL M<1-3> <duty> SETVEL1/2/3 <duty> PID1/2/3 <setpoint_deg> BEND <theta_deg> <phi_deg> TURN <theta_deg> <phi_deg> [vel_deg_s]");
  }
}

// ---------------- Programa principal ----------------

const uint32_t CHECKPOINT_INTERVALO_MS = 60000; // respaldo de posicion cada 60s
uint32_t ultimoCheckpoint = 0;

void setup() {
  Serial.begin(115200);
  delay(500);
  Serial.println();
  Serial.println("=== Fase 8: cinematica (PCC, 3 cables a 120 deg) sobre PID identificado ===");

  Wire.begin(21, 22);
  Wire.setClock(400000);
  Serial.println(as5600_1.begin() ? "OK: AS5600 #1" : "ERROR: AS5600 #1 no responde al iniciar");

  Wire1.begin(32, 33);
  Wire1.setClock(400000);
  Serial.println(as5600_2.begin() ? "OK: AS5600 #2" : "ERROR: AS5600 #2 no responde al iniciar");

  i2c3.begin(4, 13, 100000);
  uint16_t rawTest;
  bool imanTest;
  Serial.println(leerAS5600_3(rawTest, imanTest) ? "OK: AS5600 #3" : "ERROR: AS5600 #3 no responde al iniciar");

  // Restaura offsets de calibracion guardados en flash (si existen).
  int16_t off1 = cargarOffsetRaw(1);
  int16_t off2 = cargarOffsetRaw(2);
  offsetRaw3    = cargarOffsetRaw(3);
  as5600_1.setOffset(off1 * AS5600_RAW_TO_DEGREES);
  as5600_2.setOffset(off2 * AS5600_RAW_TO_DEGREES);
  Serial.print("Offsets cargados de flash -> #1: ");
  Serial.print(off1);
  Serial.print(" | #2: ");
  Serial.print(off2);
  Serial.print(" | #3: ");
  Serial.println(offsetRaw3);

  // Restaura la posicion acumulada guardada en flash (si existe) en vez de
  // reiniciar siempre en 0, para que "0" siga siendo el mismo punto fisico
  // entre reinicios/apagados. Esto asume que el eje no se movio a mano
  // mientras el ESP32 estaba apagado (el AS5600 es un sensor relativo para
  // el conteo de vueltas, no puede detectar movimiento sin alimentacion).
  // resetCumulativePosition()/resetPosicionAcumulada3() tambien resincronizan
  // la referencia interna con la posicion FISICA real actual, evitando que
  // la primera lectura interprete un salto falso.
  int32_t pos1 = cargarPosicionAcum(1);
  int32_t pos2 = cargarPosicionAcum(2);
  int32_t pos3 = cargarPosicionAcum(3);
  as5600_1.resetCumulativePosition(pos1);
  as5600_2.resetCumulativePosition(pos2);
  resetPosicionAcumulada3(pos3);
  Serial.print("Posicion restaurada de flash (cuentas RAW) -> #1: ");
  Serial.print(pos1);
  Serial.print(" | #2: ");
  Serial.print(pos2);
  Serial.print(" | #3: ");
  Serial.println(pos3);

  // Restaura el duty por motor calibrado con CALVEL (150 por defecto si
  // nunca se calibro).
  velocidadMotor[0] = (uint8_t)cargarVelocidadMotor(1);
  velocidadMotor[1] = (uint8_t)cargarVelocidadMotor(2);
  velocidadMotor[2] = (uint8_t)cargarVelocidadMotor(3);
  Serial.print("Duty por motor cargado de flash -> #1: ");
  Serial.print(velocidadMotor[0]);
  Serial.print(" | #2: ");
  Serial.print(velocidadMotor[1]);
  Serial.print(" | #3: ");
  Serial.println(velocidadMotor[2]);

  for (uint8_t i = 0; i < 3; i++) {
#if CORE_LEDC_V3
    configurarPWM(PIN_RPWM[i], 0);
    configurarPWM(PIN_LPWM[i], 0);
#else
    configurarPWM(PIN_RPWM[i], CANAL_RPWM[i]);
    configurarPWM(PIN_LPWM[i], CANAL_LPWM[i]);
#endif
    detenerMotor(i); // arranca siempre detenido
  }

  Serial.println();
  Serial.println("Comandos: M1 M2 M3 (seleccionar motor) | F (adelante) | R (reversa) | S (detener) | SS (parada de emergencia)");
  Serial.println("Calibracion: CAL1 CAL2 CAL3 -> fija 0 deg en la posicion fisica actual de ese eje (persiste en flash)");
  Serial.println("HOME: HOME1 HOME2 HOME3 (un motor) | HOME (los 3 a la vez) -> regreso a 0 en lazo cerrado, sin PID");
  Serial.println("STATUS -> imprime el angulo/vueltas y la velocidad actual (deg/s) de los 3 encoders (ya no se imprime solo, para no saturar el Monitor Serial)");
  Serial.println("CALVEL -> mide y empareja la velocidad real de los 3 motores contra el mas lento (requiere los 3 detenidos, persiste en flash)");
  Serial.println("CALVEL M<1-3> <duty> -> igual, pero fija el motor indicado a ese duty y usa su velocidad como objetivo. Ej: CALVEL M3 225");
  Serial.println("SETVEL1/SETVEL2/SETVEL3 <duty> -> fija a mano el duty de ese motor (sin medir), persiste en flash. Ej: SETVEL2 122");
  Serial.println("PID1/PID2/PID3 <setpoint_deg> -> activa el PID real (ganancias identificadas) en ese motor, con ese setpoint. Ej: PID2 45.0");
  Serial.println("BEND <theta_deg> <phi_deg> -> dobla el segmento theta grados hacia la direccion phi (modelo PCC, 3 cables a 120), activa el PID de los 3 motores. Ej: BEND 15 90");
  Serial.println("TURN <theta_deg> <phi_deg> [vel_deg_s] -> gira la direccion del doblez a phi_deg manteniendo theta_deg fijo durante todo el giro (control de velocidad, no de posicion - un tiron continuo suave, no pasa por apertura total). Ej: TURN 45 270 15");
  Serial.println("Motor activo por defecto: 1.");
  Serial.println();

  ultimoCheckpoint = millis();
}

void loop() {
  if (Serial.available()) {
    String linea = Serial.readStringUntil('\n');
    procesarComando(linea);
  }

  actualizarEncoders();
  actualizarVelocidadEstimada();

  // Avanza el homing (si esta activo) de cada motor, tambien en cada
  // iteracion de loop() para reaccionar rapido si hay que abortar.
  actualizarHoming(0);
  actualizarHoming(1);
  actualizarHoming(2);

  // Avanza el giro TURN (si esta activo) antes que el PID, para que el
  // setpoint recalculado en este ciclo ya este listo cuando el PID actue.
  actualizarGiro();

  // Avanza el PID (si esta activo) de cada motor. actualizarPID() se
  // autolimita a PID_INTERVALO_MS, es seguro llamarla en cada iteracion.
  actualizarPID(0);
  actualizarPID(1);
  actualizarPID(2);

  // Respaldo periodico en flash, por si el ESP32 pierde alimentacion
  // mientras un motor sigue en movimiento (detenerMotor() ya guarda al
  // detenerse, esto es solo la red de seguridad para ese caso puntual).
  uint32_t ahora = millis();
  if (ahora - ultimoCheckpoint >= CHECKPOINT_INTERVALO_MS) {
    ultimoCheckpoint = ahora;
    for (uint8_t i = 0; i < 3; i++) guardarPosicionMotor(i);
  }
}
